# PhaseId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementPhaseStatusFilter..::..PhaseId Property
ElementPhaseStatusFilter Class See Also
---
The phase id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId PhaseId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PhaseId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ PhaseId {
	ElementId^ get ();
}
```

# See Also
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace